app/views/registries/_edit_form.html.erb

<%= f.fields_for :registry_coordinators do |task_form| %>
     <%= task_form.select :coordinator_id, Coordinator.all.collect { |p| [ p.email, p.id ] } %>
---
SELECT "coordinators".* FROM "coordinators"