app/controllers/coordinators_controller.rb

  def index
    @coordinators = Coordinator.all
---
SELECT "coordinators".* FROM "coordinators"

  def create
    @coordinator = Coordinator.new(coordinator_params)

    respond_to do |format|
      if @coordinator.save
---
INSERT INTO "coordinators" ("email", "name", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "coo1@abc.com"], ["name", "1"], ["phone", "1"], ["created_at", "2016-06-07 11:26:10.272085"], ["updated_at", "2016-06-07 11:26:10.272085"]]

    def set_coordinator
      @coordinator = Coordinator.find(params[:id])
---
SELECT  "coordinators".* FROM "coordinators" WHERE "coordinators"."id" = ? LIMIT 1  [["id", 1]]