app/controllers/participants_controller.rb

  def index
    @participants = Participant.all
---
SELECT "participants".* FROM "participants"

  def create
    @participant = Participant.new(participant_params)

    respond_to do |format|
      if @participant.save
        format.html { redirect_to @participant, notice: 'Participant was successfully created.' }
        format.json { render :show, status: :created, location: @participant }
      else
        format.html { render :new }
        format.json { render json: @participant.errors, status: :unprocessable_entity }
      end
    end

    unless participant_params[:registry_participants_attributes].nil?
      participant_params[:registry_participants_attributes].each do |key,value|
          value = value.except(:_destroy)
          @registry_participant = @participant.registry_participants.new(value)
          @registry_participant.save
---
INSERT INTO "participants" ("name", "gender", "contact_method", "remarks", "coordinator", "date_of_birth", "date_of_enrollment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "registry_participants" ("registry_id", "participant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["registry_id", 4], ["participant_id", 4], ["created_at", "2016-06-08 15:09:13.959551"], ["updated_at", "2016-06-08 15:09:13.959551"]]

  def update
    respond_to do |format|
      if @participant.update(participant_params)
        format.html { redirect_to @participant, notice: 'Participant was successfully updated.' }
        format.json { render :show, status: :ok, location: @participant }
      else
        format.html { render :edit }
        format.json { render json: @participant.errors, status: :unprocessable_entity }
      end
    end

    unless participant_params[:registry_participants_attributes].nil?
      participant_params[:registry_participants_attributes].each do |key,value|
        if value[:_destroy]=="1"
          @registry_participant = @participant.registry_participants.find(value[:id])
---
SELECT  "participants".* FROM "participants" WHERE "participants"."id" = ? LIMIT 1  [["id", 8]]

  def destroy
    @participant.destroy
---
DELETE FROM "participants" WHERE "participants"."id" = ?  [["id", 4]]

    def set_participant
      @participant = Participant.find(params[:id])
---
SELECT  "participants".* FROM "participants" WHERE "participants"."id" = ? LIMIT 1  [["id", 6]]