app/controllers/registries_controller.rb

  def index
    @registries = Registry.all
---
SELECT "registries".* FROM "registries" WHERE (open == true)

  def show
    coordinator_emails = []
    @registry.registry_coordinators.all.each do |registry_coord|
      coordinator_email =  Coordinator.find(registry_coord.coordinator_id).email
      coordinator_emails.push(coordinator_email)
    end
    coordinator_emails = coordinator_emails.uniq
    @coordinator_emails_string = coordinator_emails.map(&:inspect).join(', ')

    @participant_list = []
    @registry.registry_participants.all.each do |registry_data|
      participant =  Participant.find(registry_data.participant_id)
---
SELECT "coordinators".* FROM "coordinators"
SELECT "registry_coordinators".* FROM "registry_coordinators" WHERE "registry_coordinators"."registry_id" = ?  [["registry_id", 4]]
SELECT  "coordinators".* FROM "coordinators" WHERE "coordinators"."id" = ? LIMIT 1  [["id", 1]]
SELECT "registry_participants".* FROM "registry_participants" WHERE "registry_participants"."registry_id" = ?  [["registry_id", 2]]
SELECT  "participants".* FROM "participants" WHERE "participants"."id" = ? LIMIT 1  [["id", 5]]

  def edit
    puts params
    @registry = Registry.find(params[:id])
---
SELECT  "registries".* FROM "registries" WHERE "registries"."id" = ? LIMIT 1  [["id", 6]]

  def create
    puts params
    @registry = Registry.new(registry_params)

    respond_to do |format|
      if @registry.save
        format.html { redirect_to @registry, notice: 'Registry was successfully created.' }
        format.json { render :show, status: :created, location: @registry }
      else
        format.html { render :new }
        format.json { render json: @registry.errors, status: :unprocessable_entity }
      end
    end
    unless registry_params[:registry_coordinators_attributes].nil?
      registry_params[:registry_coordinators_attributes].each do |key,value|
          value = value.except(:_destroy)
  	      @registry_coordinator = @registry.registry_coordinators.new(value)
        	@registry_coordinator.save
---
INSERT INTO "registries" ("name", "location", "open", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "reg1"], ["location", "l1"], ["open", "t"], ["created_at", "2016-06-07 12:20:51.981406"], ["updated_at", "2016-06-07 12:20:51.981406"]]
INSERT INTO "registry_coordinators" ("coordinator_id", "registry_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["coordinator_id", 1], ["registry_id", 2], ["created_at", "2016-06-07 13:18:33.315736"], ["updated_at", "2016-06-07 13:18:33.315736"]]

  def update
    respond_to do |format|
      if @registry.update(registry_params)
        format.html { redirect_to @registry, notice: 'Registry was successfully updated.' }
        format.json { render :show, status: :ok, location: @registry }
      else
        format.html { render :edit }
        format.json { render json: @registry.errors, status: :unprocessable_entity }
      end
    end

    unless registry_params[:registry_coordinators_attributes].nil?
      registry_params[:registry_coordinators_attributes].each do |key,value|
        if value[:_destroy]=="1"
          @registry_coordinator = @registry.registry_coordinators.find(value[:id])
          @registry_coordinator.destroy
---
UPDATE "registries" SET "location" = ?, "updated_at" = ? WHERE "registries"."id" = ?  [["location", "l7"], ["updated_at", "2016-06-08 15:30:29.939891"], ["id", 7]]
SELECT  "registries".* FROM "registries" WHERE "registries"."id" = ? LIMIT 1  [["id", 6]]
SELECT "registry_coordinators".* FROM "registry_coordinators" WHERE "registry_coordinators"."registry_id" = ? AND "registry_coordinators"."id" IN (90, 91, 92, 93, 94, 95, 96, 97)  [["registry_id", 7]]
DELETE FROM "registry_coordinators" WHERE "registry_coordinators"."id" = ?  [["id", 90]]

  def destroy
    @registry.destroy
---
DELETE FROM "registries" WHERE "registries"."id" = ?  [["id", 1]]

    def set_registry
      @registry = Registry.find(params[:id])
---
SELECT  "registries".* FROM "registries" WHERE "registries"."id" = ? LIMIT 1  [["id", 1]]