app/controllers/registry_coordinators_controller.rb

SELECT "registry_coordinators".* FROM "registry_coordinators"
---
  def index
    @registry_coordinators = RegistryCoordinator.all

DELETE FROM "registry_coordinators" WHERE "registry_coordinators"."id" = ?  [["id", 1]]
---
  def destroy
    @registry_coordinator.destroy

SELECT  "registry_coordinators".* FROM "registry_coordinators" WHERE "registry_coordinators"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_registry_coordinator
      @registry_coordinator = RegistryCoordinator.find(params[:id])